index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-11-17 Tue 20:31 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Pranav Bhaskar</title>
<meta name="generator" content="Org mode">
<meta name="author" content="pranav">
<link rel="stylesheet" type="text/css" href="test.css" />
</head>
<body>
<div id="content">
<h1 class="title">Pranav Bhaskar</h1>
<aside>
<h1 id="name">Pranav Bhaskar</h1>
<h2 id="title">WEB DEVELOPER</h2>
<p>
Pune, Maharashtra, India
</p>
<div class="links">
<ul class="org-ul">
<li>Email: pranavbhaskar17@gmail.com</li>
<li>GitHub: <a href="https://github.com/CoderPrans">https://github.com/CoderPrans</a></li>
<li>LinkedIn: <a href="https://linkedin.com/in/CoderPrans">https://linkedin.com/in/CoderPrans</a></li>
<li>Twitter: <a href="https://twitter.com/CoderPrans">https://twitter.com/CoderPrans</a></li>
</ul>
</div>
<h2>Skills</h2>
<p>
HTML5, CSS3, JavaScript, React.js,
Node.js, MongoDB, Git, PWAs
</p>
<h2>Certifications</h2>
<div class="certificates">
<ul class="org-ul">
<li>Front End Libraries, FreeCodeCamp
<ul class="org-ul">
<li><a href="https://www.freecodecamp.org/certification/coderprans/front-end-libraries">https://www.freecodecamp.org/certification/coderprans/front-end-libraries</a></li>
</ul></li>
<li>Responsive Web Design, FreeCodeCamp
<ul class="org-ul">
<li><a href="https://www.freecodecamp.org/certification/coderprans/responsive-web-design">https://www.freecodecamp.org/certification/coderprans/responsive-web-design</a></li>
</ul></li>
<li>Front End Development, FreeCodeCamp
<ul class="org-ul">
<li><a href="https://www.freecodecamp.org/certification/coderprans/legacy-front-end">https://www.freecodecamp.org/certification/coderprans/legacy-front-end</a></li>
</ul></li>
<li>APIs and Microservices, FreeCodeCamp
<ul class="org-ul">
<li><a href="https://www.freecodecamp.org/certification/coderprans/apis-and-microservices">https://www.freecodecamp.org/certification/coderprans/apis-and-microservices</a></li>
</ul></li>
<li>Javascript Algorithms and Data Structures, FreeCodeCamp
<ul class="org-ul">
<li><a href="https://www.freecodecamp.org/certification/coderprans/javascript-algorithms-and-data-structures">https://www.freecodecamp.org/certification/coderprans/javascript-algorithms-and-data-structures</a></li>
</ul></li>
<li>Data Visualization, FreeCodeCamp
<ul class="org-ul">
<li><a href="https://www.freecodecamp.org/certification/coderprans/data-visualization">https://www.freecodecamp.org/certification/coderprans/data-visualization</a></li>
</ul></li>
</ul>
</div>
</aside>


<div id="outline-container-org4b6cdfb" class="outline-2">
<h2 id="org4b6cdfb">Experience</h2>
<div class="outline-text-2" id="text-org4b6cdfb">
</div>
<div id="outline-container-org0c28b21" class="outline-3">
<h3 id="org0c28b21">Freelancing</h3>
<div class="outline-text-3" id="text-org0c28b21">
<b>Jan 2020 - present</b>
<p>
Notable Projects: <a href="https://hunarpro.coderprans.vercel.app/">HunarPro</a>, <a href="https://warjecms.org/">CMS Warje</a>
</p>
<span />
<p>
Tech Used: React, React/Next, Python, Svelte
</p>
</div>
</div>


<div id="outline-container-orgbb88c16" class="outline-3">
<h3 id="orgbb88c16">Web Developer, Opinta Solutions Pvt. Ltd.</h3>
<div class="outline-text-3" id="text-orgbb88c16">
<b>Sep 2018 - Jan 2020 (1 year 5 months)</b>
<p>
Notable Projects: <a href="https://opintasolutions.coderprans.now.sh">Opinta Solutions(Website)</a>, <a href="https://extrasave.coderprans.now.sh/">ExtraSave</a>  
</p>
<span />
<p>
Tech Used: React, React/Gatsby, Node, MongoDB, GraphQL 
</p>
</div>
</div>
</div>


<div id="outline-container-org5c42375" class="outline-2">
<h2 id="org5c42375">Selected Projects</h2>
<div class="outline-text-2" id="text-org5c42375">
</div>
<div id="outline-container-orgd47c7da" class="outline-3">
<h3 id="orgd47c7da">Hindi Archive</h3>
<div class="outline-text-3" id="text-orgd47c7da">
<ul class="org-ul">
<li><a href="https://hindiarchive.netlify.app">https://hindiarchive.netlify.app</a></li>
</ul>
<p>
Search frontent for searching Hindi contents on the Internet Archive.
</p>
<span />
<p>
Tech Used: React, Flask
</p>
</div>
</div>


<div id="outline-container-org7e3f1f3" class="outline-3">
<h3 id="org7e3f1f3">Opinta Solutions</h3>
<div class="outline-text-3" id="text-org7e3f1f3">
<ul class="org-ul">
<li><a href="https://opintasolutions.coderprans.now.sh/">https://opintasolutions.coderprans.now.sh/</a></li>
</ul>
<p>
Website/Blog for a web solutions startup.
</p>
<span />
<p>
Tech Used: React/Gatsby, Headless CMS(WordPress)
</p>
</div>
</div>


<div id="outline-container-org77d29d6" class="outline-3">
<h3 id="org77d29d6">Hunar Pro</h3>
<div class="outline-text-3" id="text-org77d29d6">
<ul class="org-ul">
<li><a href="https://hunarpro.coderprans.vercel.app/">https://hunarpro.coderprans.vercel.app/</a></li>
</ul>
<p>
Website for Robotics skill training startup.
</p>
<span />
<p>
Tech Used: React/Next, Stripe
</p>
</div>
</div>


<div id="outline-container-orgd669de5" class="outline-3">
<h3 id="orgd669de5">RSS Reader</h3>
<div class="outline-text-3" id="text-orgd669de5">
<ul class="org-ul">
<li><a href="https://rss-reader.coderprans.vercel.app/">https://rss-reader.coderprans.vercel.app/</a></li>
</ul>
<p>
PWA feed reader
</p>
<span />
<p>
Tech Used: React/Next, MongoDB
</p>
</div>
</div>
</div>


<div id="outline-container-org1b11ccf" class="outline-2">
<h2 id="org1b11ccf">Education</h2>
<div class="outline-text-2" id="text-org1b11ccf">
</div>
<div id="outline-container-org60312ab" class="outline-3">
<h3 id="org60312ab">freeCodeCamp.org</h3>
<div class="outline-text-3" id="text-org60312ab">
<b>Jan 2017 - present</b>
<p>
Full Stack Web Development Certification, Computer Software Engineering
</p>
</div>
</div>


<div id="outline-container-org0cf51c5" class="outline-3">
<h3 id="org0cf51c5">MIT Academy of Engineering, Alandi, Pune</h3>
<div class="outline-text-3" id="text-org0cf51c5">
<b>June 2016 - September 2020</b>
<p>
Bachelor of Technology (BTech), Electronics Engineering
</p>



<div class="todos">
<p>
TODO Add more links
TODO Add certificate links
TODO Add projects
TODO Describe experiences
TODO Improve summary
TODO Add relevent skills
</p>

</div>
</div>
</div>
</div>
</div>
</body>
</html>
